<?php
session_start(); // Розпочати сесію (якщо ще не розпочата)

// Отримання значень з форми
$login = $_POST['login'];
$password = $_POST['password'];

// Перевірка на вірність логіна і пароля
if ($login === 'admin' && $password === 'admin') {
    // Вірний логін і пароль

    // Збереження інформації про авторизацію в сесії
    $_SESSION['user_id'] = 1; // Наприклад, встановлюємо ID авторизованого користувача

    // Перенаправлення на іншу сторінку
    header('Location: admin_panel.html');
    exit();
} else {
    // Невірний логін або пароль

    // Виведення повідомлення про помилку
    echo "Невірний логін або пароль";
}
?>